{
    "title":"2.1y",
    "subtitle":"Material Design and New Navigation",
    "body":"<h2>2.1y</h2><br><h3>Overview</h3><br>v2.1 fully implements Material Design Components, used in the Mobile Title Bar from v2.0.<br><ul><li>Material Components<li>Menu Changes<li>New Photos Page<li>Web Share API<li>Page Sections</ul><br><h3>Material Components</h3><br>In Version 2.0, Material Components were brought only into the mobile navigation bar. Material components are useful, because they allow the use of Google's Material Design Guidelines easily and quickly on the web.<br>In this release, Material Componenets on the site are: The redesigned (and now default) simple title bar uses Material Toolbar, and Material Tabs. The JavaScript page is a test for Material Buttons and Inputs.<br>In future releases, Material Components will be used more and more on the site.<br><br><h3>Menu Changes</h3><br>As mentioned, the menu has been changed to now use Google's Material Design Components for the entire header, not just the tabs. That means that the shadow, title, and every other part fit much better with the Android System, as well as working much better on screens of any size.<br><br><br><h3>New Photos Page</h3><br>The Photos Page, introduced in <a href='/txt/?document=https://jgames101.github.io/updates/info/logs/v0.8a.txt'>v0.8a</a>, which has been unfuctional ever since, now integrates with the videos page, renamed Media.<br>There are two sections: Videos, as before, and Photos, showing photos you can click on to view in the photos viewer.<br>Much like the videos viewer and the txt viewer, the photos viewer takes data from the URL to display a picture. It finds the picture, and, if on the site, shows a title. You can move it around the page, press the reset button to bring it back to the middle, press the share button to share (more about that below),and press the back button to return to the media page.<br>The Photos Viewer, while still using Material Design Components to be somewhat similar to the rest of the site, is visually distint, unlike the videos viewer. It has a black background, and the toolbar is completely different.<br>This viewer is still in progress, and may be changed in the future.<br><h3>Web Share API</h3><br>The JavaScript page contains a new experiment, a button that triggers the web share API.<br>This only works on Chrome for Android 61+, and Chrome for Desktop 64+. More browser support, such as firefox and edge, will be coming soon.<br>When tapped, it brings up the system file share page. This allows for the site to be shared on Instagram, Facebook, Twitter, or anything else that supports Android's Share system.<br>Because of how well it worked on the JavaScript page, this has also been brought to the titlebar: a button on every page, that lets you share whatever you are looking at. A video, a photo, some code, anything.<br>This is an amazing feature that makes PWAs work much more like native apps on Android.<br><br><h3>Page Sections</h3><br>Since the first version, there have always been subtitles between sections of cards. The only thing that has changed about them since then is colour.<br>However, in this version, there is now an expand/contract button next to any subtitle. It will expand or contract the content of that section, to allow for easier browsing of the site.<br>This feature is based off of the Advanced section in Options, but has been simplified to apply to every subtitle, easily.<br>To save space, some less important sections default to closed.<br><br><h3>Other Things</h3><br>The Background has been removed from the page. This may be brought back in future releases, but there are currently no concrete plans to do so."
}