{
    "title":"2.2y",
    "subtitle":"A New Homepage Design that Emphasizes Content over Pages",
    "body":"v2.2 redesigns the homescreen to emphasize content, with the new newsfeeds, as well as finally implementing primary and secondary colour options for the Material components that are being added more and more.<br><ul><li>Newsfeeds<li>Material Components<li>Colour Options</ul><br><h3>Newsfeeds</h3><br>Newsfeeds are a new feature in the site that loads in the latest news from JSON files.<br>There are three of them on the homescreen: News, Code, and Media. They serve to emphasize the content of the site on the homescreen.<br>The original idea was to have a dedicated page for these, and that may still come in the future, but for now, it is only visible on the homescreen.<br>You can learn more about the newsfeeds in the much longer writing about the coding side of it <a href='/txt/?document=/news/dev.txt'>here</a>.<br><br><h3>Material Components</h3><br>As with the previous version, Material Components have been brought to more places. The new newsfeeds use the Material Design Cards, the options page now uses Material Design cards for its redesigned personalization options, and the updates page now uses Material Buttons for the more info links.<brAs I said in the previous version, Material Components will be coming to more places in the future.<br><h3>Colour Options</h3><br>In Material Design, your design has two colours: Primary and Secondary. While the site has been using Primary colours for a long time, the colour has been tied to the background picture, and there has been no choice of secondary colour.<br>However, in version <a href='/txt/?document=https://jgames101.github.io/updates/info/logs/v2.1y'>2.1y</a> the background was removed, meaning that colour options were gone.<br>To fix this, and work better with the growing number of Material Components, the site now allows you to choose a primary and a secondary colour.<br>These are used across the site.<br><br>"
}