{
    "title":"v3.0δ",
    "subtitle":"A faster, more efficient design.",
    "body":"Version 3.0 builds upon the internal changes from v2.0 to create a fast, simple, and more feature-filled site.<br><h2>The Speed</h2><br>In version 2.0, the page content was moved to a seperate file than the index.html file, so that the page container, such as the menu, could be loaded before the page. v3.0 has taken advantage of that feature, with the two major internal changes, being<br><ul><li>The Container is now always the root index.html</li><li>Content is loaded without reloading the page container</li></ul><br>The first big change is that the container is <b>always</b> loaded from the root index.html file, rather than from the index.html file in whatever folder. The .htaccess file that was first added for the 404 support now redirects to the root index.html rather than the 404 page.<br>This in turn means that any features added to the page container, such as the news reader, now apply to all pages by default. It lightens the workload for adding new features and makes the pages more consistent.<br>As before, the page content is loaded after the container, but instead of being loaded from the page title, it is loaded from the URL, meaning that it does not require seperate index.html files for every page anymore.<br>The second major change is that now, instead of the whole page, including the container, having to be loaded whenever you change pages, the site now takes advantage of the History API to now change the page url without refresing the page, and then uses the same mechanics that it uses to originally load the page to replace the contents.<br>This change increases the speed of the site, especially on slow connections, because it only has to load the content, rather than reload the JavaScript, the CSS, and everything else that makes the site work.<hr>Those internal changes allowed for some new features to be added to the site.<br><h2>New Features</h2><ul><li>PiP Video Player (Alpha)</li><li>News popout on every page</li><li>Themes are back!</li><li>The page now (finally) works without JavaScript, or without a modern browser</li><li>Two new Images have been added to the site.</li><li>Setup is now a page on the site</li><li>Every Page has its own URL</li></ul><br><br><h2>PiP Video Player (Alpha)</h2><br>The PiP video player is an experiment in this version. You can enable it by going to Options > Advanced features. Depending on the version, there will be options there, or a link to the flags page. If it's the latter, click on the flags link. From there, find 'Enable PiP mode'. It may or may not be enabled already. When enabled, if you are playing a video, and click a link that takes you to another page, and have JavaScript enabled as well as a browser that supports the History API, then you will see that the content of the page loads, but the video continues playing in the bottom corner of the page.<br>There are a few bugs with this feature, which is why it's currently locked behind an advanced option. First of all, when you start using the PiP player, the video restarts. This will be fixed with a rebuild of the video player in a future version.<br>The other problem is that when clicking the expand button, the video ID gets set to '00000000000', rather than the original video's ID. The new PiP player still uses the YouTube player, but the controls are not accessible. Instead, when you hover over the video, you will get a close button, and an expand button.<br><h2>News Popout on Every Page</h2><br>Because the index.html file is now loaded on every page, that means that the news popup works on any page. In previous versions, the homescreen links in the News feeds would take you to the news page with the Article set to whatever version.<br>Now, it loads the news popup on whatever page. Currently, that means the home page, the news page, and the updates page. Like the rest of this update, it improves the speed of the site. It also improves the UX of the site, because it makes sense that it could load on any site.<br><h2>Themes Are Back!</h2><br>Around version 2.0-2.1, the themes system stopped working. It broke with the redesign of the site, because the text on the page would not be recoloured, and neither would the menu. There were many problems with the themes in those versions, so they have now been fixed.<br>Right now, there are three themes: Colourful, Light, and Dark. Unlike in v1.X, Dark theme does not recolour the menu, just the page. The light theme does, however, recolour the menu. If you haven't changed your theme since version 1.X, the default theme is colourful.<br><h2>No JavaScript support</h2><br>Like in older versions of the site, it now functions (at least somewhat) without JavaScript, or with an old browser.<br>Without JavaScript, the page will load a no javascript page. This is a very limited version of the site, without the ability to do certain things. It is mostly centered around media.<br>On old browsers, the History API may not be supported. That's Okay! If the history API is not supported, the site now falls back on regular a href stuff. This is good for browsers that don't support History API, and for search engines to crawl the site.<br>However, that doesn't mean that the site works without JavaScript. Because of the way that the site works, it will not work properly. There's just an overlay like in older versions. Now, when not using JavaScript, there's a specific page loaded ONLY when JavaScript is disabled, which is mostly just for viewing media. The navigation buttons don't do very much, though. <br><h2>Two New Images</h2>This update added two new images:<br><img src='/photos/13.jpg' width='100%'><img src='/photos/14.png' width='100%'><br><br><h2>The Setup Page is now a page</h2><br>In older versions of the site, Setup behaved as a completely different site.<br>But now, Setup behaves as a page, just like any other page on the site.<br><h2>Every Page Has Its Own URL</h2><br>With all of the changes in this version, you may be concerned that pages no longer have unique URLs, but fear not, every page still has its own URL."
}