{
    "title":"v3.2δ",
    "subtitle":"Swipes, Grids, and a new Video Player",
    "body":"Version 3.2 has many new features, like CSS Grid and Swipe gestures. As well as that, there's a new video player, Picture in Picture mode finalized, and more.<br><br><h2>CSS Grid</h2><br>CSS Grid is currently a very popular tool for layouts. It is an amazing tool, and very easy to use. Before v1.44's card sorting mechanics, the cards use inline-table to make all of the cards lay out in a line.<br>With this version, the site is moving away from the columns design, because...<br><ul><li>The design does not work very well for screen readers<li>The HTML is messy, because it's by columns, and not by rows, as you'd expect for the way it's ordered.<li>Using pure HTML/CSS is superior for performance.</ul><br>CSS grid is a feature that lets you make a container element a grid, using the elements inside the container as cells in the grid. You can use it for responsive design, because you can change the amount of columns depending on the screen-size.<br>You can make elements take up multiple columns, multiple rows, or just one cell.<br>This site is now using it for the cards, because of its elegance and ease. Unlike sorting cards into columns, the layout remains the same, and goes by row. That means that the DOM is much simpler, it can be read properly by screen readers, and loads fast because it's just HTML and CSS.<br><br><h2>Swipe Gestures</h2><br>Using <a href='https://github.com/thebird/Swipe'>Swipe from GitHub</a>, the site now features swipe gestures. You can change between three pages in each tab on a touchscreen device very easily. This caused a lot of internal changes, because there is now three content pages internally, that can be swiped between.<br><br><h2>New Video Player</h2><br><img src='/photos/screenshot/videoPlayer3.2.jpg' width='100%'><br>The new video player in this version. It has been completely redesigned. The reason for this redesign is so that PiP support works properly, without restarting the video.<br>This new design is very bold and puts the title, description, likes, views, and dislikes beside the video.<br>The design in this page is inspired by modern design trends.<br><br><h2>Picture in Picture Mode</h2><br>Picture in Picture mode, although it was added in version 3.0, was not fully functional. The problem was that when you entered PiP mode, the video would restart. Now, in this version, because of the redesign of the video player, the video is not restarted when expanding the video, or putting it in PiP mode."
}